CarmelaDA/HomeArt_STM32/Core/Src/main.c
  // Office Servo
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);

  // Living Room DC Motor
  HAL_TIM_PWM_Start(&htim9, TIM_CHANNEL_1);

  // Buzzer
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  /*----------- DHT22 Sensor-----------*/ //______________________________________________________________________________________________AQUÍ
  HAL_TIM_Base_Start(&htim6);

  /*----------- Inicialización LDR & HW390 & Lluvia -----------*/
  HAL_ADC_Start(&hadc1); // LDR
  HAL_ADC_Start(&hadc2); // HW-390
  HAL_ADC_Start(&hadc3); // Lluvia

  //__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
  ESP_Init("iPhone Carmela","pistacho");
  //ESP_Init("iPhone de Mario","11111111");
  //ESP_Init("MPIGDATA","B88458609A");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  	ESP_messageHandler();

		// TIMBRE VEHICULO
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == 0){

			int known = readLector();
			if(known == 1){
				char conocido[18]= "ABRIENDO PUERTA \n\n";
				HAL_UART_Transmit(&huart6, (uint8_t *) conocido, 18, HAL_MAX_DELAY);

				actParcelaRFID();
			}
			else if(known == 0){
				char desconocido[18] = "LLAMANDO TIMBRE \n\n";
				HAL_UART_Transmit(&huart6, (uint8_t *) desconocido, 18, HAL_MAX_DELAY);

				playTimbre();
			}
		}

		// TIMBRE PEATÓN
		if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == 0){

				playTimbre();
		}

		// STOP ALARMA
		if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15) == 0){

			__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 0);
		}

		// ALARMA
		if (debouncer(&inside, S_Int_GPIO_Port, S_Int_Pin)){

			if(vSeg[0] == '1') playAlarma();
		}
		if (debouncer(&outside, S_Ext_GPIO_Port, S_Ext_Pin)){

			if(vSeg[1] == '1') playAlarma();
		}

		// PUERTA PARCELA (90)
		if(vVent[0]=='1' || vExt[4]=='1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 91);
		if(vVent[0]=='0' || vExt[4]=='0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 89);

		// PUERTA GARAJE (90)
		if(vVent[1]=='1' || vGar[1] == '1') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 92); // más rápido a 30
		if(vVent[1]=='0' || vGar[1] == '0') __HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 89);

		// TOLDO TENDEDERO (90)
		if(vExt[0]=='1'){
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
			awning = 1;
		}
		if(vExt[0]=='0'){
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 88);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
			toldo = 0;
		}
		vExt[0]='x';

		// VENTANA SALÓN (90)
		if(vVent[2]=='1' || vSal[5]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 90);
		}
		if(vVent[2]=='0'|| vSal[5]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 89);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_4, 90);
		}
		vVent[2]='x';
		vSal[5]='x';

		// VENTANA DORMITORIO (90)
		if(vVent[3]=='1' || vDor[3]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 92);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 90);
		}
		if(vVent[3]=='0' || vDor[3]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 89);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, 90);
		}
		vVent[3]='x';
		vDor[3]='x';

		// VENTANA OFICINA (90)
		if(vVent[4]=='1' || vOfi[11]=='1') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 91);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 90);
		}
		if(vVent[4]=='0' || vOfi[11]=='0') {
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 88);
			HAL_Delay(3000);
			__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_3, 90);
		}
		vVent[4]='x';
		vOfi[11]='x';

		// FINAL DE CARRERA PARCELA
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_6) == 0){

			if (vVent[0]=='1' || vExt[4]=='1'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 89); // S_Parcela
				HAL_Delay(1000);
			}
			if (vVent[0]=='0' || vExt[4]=='0'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 91); // S_Parcela
				HAL_Delay(1000);
			}
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_1, 90); // S_Parcela
			vVent[0]='x'; // S_Parcela
			vExt[4]='x'; // S_Parcela
		}

		// FINAL DE CARRERA GARAJE
		if(HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_4) == 0){

			if (vVent[1]=='1' || vGar[1]=='1'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 89); // S_Garaje
				HAL_Delay(1000);
			}
			if (vVent[1]=='0' || vGar[1]=='0'){
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 92); // S_Garaje
				HAL_Delay(1000);
			}
			__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_2, 90); // S_Garaje
			vVent[1]='x'; // S_Garaje
			vGar[1]='x'; // S_Garaje
		}

		// VENTILADOR SALÓN
		if(vTemp[0]=='1') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 1000);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}
		if(vTemp[0]=='0') {
			__HAL_TIM_SET_COMPARE(&htim9, TIM_CHANNEL_1, 0);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_4,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_5,GPIO_PIN_RESET);
		}

		// VALORES DE CONFIGURACIÓN
		v_enc = temp_value(vAj[0], vAj[1], vAj[2]);
		f_off = temp_value(vAj[3], vAj[4], vAj[5]);
		h_on = temp_value(vAj[6], vAj[7], vAj[8]);
		h_off = temp_value(vAj[9], vAj[10], vAj[11]);

		rh_min = rh_value(vAj[12], vAj[13]);
		rh_max = rh_value(vAj[14], vAj[15]);


		/*----------- Lectura Sensores -----------*/

		// LDR
		if(HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY) == HAL_OK)
			LDR_value = HAL_ADC_GetValue(&hadc1);

		ldr(LDR_value);

		// Lluvia
		if(HAL_ADC_PollForConversion(&hadc3, HAL_MAX_DELAY) == HAL_OK)
			Rain_read = HAL_ADC_GetValue(&hadc3);

		Rain = 100 - ((100*Rain_read)/255);

		if(vExt[5] == '1'){
			// Si hay ropa tendida y llueve (con tendedero cerrado)
			if (Lluvia_real>5 && vExt[6] == '1' && awning == 0){

				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 91); // Abrir tendedero
				HAL_Delay(3000);
				__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, 90);
				toldo = 1;
			}

